# Comparative analysis of kids entering care in Nottingham 2011-2016
#### Data source: https://www.gov.uk/government/collections/statistics-looked-after-children

Import pandas

In [34]:
import pandas as pd

Import datasets

In [35]:
yr11 = pd.read_csv("data/2011.csv");

In [36]:
yr12 = pd.read_csv("data/2012.csv");

Inspect and edit column names by year, leaving geographical ID on which to merge

In [37]:
yr11.head(1)

,New_geog_code,geog_l,geog_c,geog_n,CLA_started2011,CLA_taken2011,SCLA_male,SCLA_female,SCLA_U1,SCLA_1to4,...,SCLA_ICO,SCLA_FCO,SCLA_POG,SCLA_S20,SCLA_UPP,SCLA_SEPO,SCLA_UCAO,SCLA_ONCT,SCLA_PACE,SCLA_SORR
0,E92000001,NATIONAL,999,ENGLAND,27310,9480,14390,12920,5320,5670,...,5410,150,20,17320,3270,630,10,480,10,10

In [38]:
yr11.columns = [str(col) + '_11' for col in yr11.columns]

In [48]:
yr11 = yr11.rename(columns={'New_geog_code_11': 'New_geog_code'})

In [49]:
yr11.head(1)

,New_geog_code,geog_l_11,geog_c_11,geog_n_11,CLA_started2011_11,CLA_taken2011_11,SCLA_male_11,SCLA_female_11,SCLA_U1_11,SCLA_1to4_11,...,SCLA_ICO_11,SCLA_FCO_11,SCLA_POG_11,SCLA_S20_11,SCLA_UPP_11,SCLA_SEPO_11,SCLA_UCAO_11,SCLA_ONCT_11,SCLA_PACE_11,SCLA_SORR_11
0,E92000001,NATIONAL,999,ENGLAND,27310,9480,14390,12920,5320,5670,...,5410,150,20,17320,3270,630,10,480,10,10

In [50]:
yr12.columns = [str(col) + '_12' for col in yr12.columns]

In [51]:
yr12 = yr12.rename(columns={'New_geog_code_12': 'New_geog_code'})

In [53]:
yr12.head(1)

,New_geog_code,geog_l_12,geog_c_12,geog_n_12,CLA_started2012_12,CLA_taken2012_12,SCLA_male_12,SCLA_female_12,SCLA_U1_12,SCLA_1to4_12,...,SCLA_ICO_12,SCLA_FCO_12,SCLA_POG_12,SCLA_S20_12,SCLA_UPP_12,SCLA_SEPO_12,SCLA_UCAO_12,SCLA_ONCT_12,SCLA_PACE_12,SCLA_SORR_12
0,E92000001,NATIONAL,999,ENGLAND,28220,10100,14880,13340,5880,5770,...,6020,190,30,17600,3190,700,0,470,10,10

Merge datasets

In [54]:
merged = pd.merge(yr11, yr12, on='New_geog_code')

In [55]:
merged.head(0)

Empty DataFrame
Columns: [New_geog_code, geog_l_11, geog_c_11, geog_n_11, CLA_started2011_11, CLA_taken2011_11, SCLA_male_11, SCLA_female_11, SCLA_U1_11, SCLA_1to4_11, SCLA_5to9_11, SCLA_10to15_11, SCLA_16over_11, SCLA_AbNeg_11, SCLA_Cdisab_11, SCLA_ParIll_11, SCLA_FAcSt_11, SCLA_FD_11, SCLA_SUB_11, SCLA_LI_11, SCLA_AbsPar_11, SCLA_ICO_11, SCLA_FCO_11, SCLA_POG_11, SCLA_S20_11, SCLA_UPP_11, SCLA_SEPO_11, SCLA_UCAO_11, SCLA_ONCT_11, SCLA_PACE_11, SCLA_SORR_11, geog_l_12, geog_c_12, geog_n_12, CLA_started2012_12, CLA_taken2012_12, SCLA_male_12, SCLA_female_12, SCLA_U1_12, SCLA_1to4_12, SCLA_5to9_12, SCLA_10to15_12, SCLA_16over_12, SCLA_AbNeg_12, SCLA_Cdisab_12, SCLA_ParIll_12, SCLA_FAcSt_12, SCLA_FD_12, SCLA_SUB_12, SCLA_LI_12, SCLA_AbsPar_12, SCLA_ICO_12, SCLA_FCO_12, SCLA_POG_12, SCLA_S20_12, SCLA_UPP_12, SCLA_SEPO_12, SCLA_UCAO_12, SCLA_ONCT_12, SCLA_PACE_12, SCLA_SORR_12]
Index: []

[0 rows x 61 columns]